In [31]:
import numpy as np
import pandas as pd

In [32]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})

In [33]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [34]:
grouped=df['data1'].groupby(df['key1'])

In [35]:
grouped

In [36]:
grouped.mean()

key1
a   -1.290983
b   -0.616175
Name: data1, dtype: float64

In [37]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [38]:
means

key1  key2
a     one    -1.605978
      two    -0.660992
b     one    -0.328740
      two    -0.903610
Name: data1, dtype: float64

In [39]:
means.unstack()

key2       one       two
key1
a    -1.605978 -0.660992
b    -0.328740 -0.903610

In [40]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [41]:
years=np.array([2005,2005,2006,2005,2006])

In [46]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [43]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.660992
            2006   -0.328740
Ohio        2005   -0.492821
            2006   -3.129923
Name: data1, dtype: float64

In [44]:
df.groupby('key1').mean()

         data1     data2
key1
a    -1.290983 -0.066279
b    -0.616175 -0.115067

In [45]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.605978  0.450369
     two  -0.660992 -1.099575
b    one  -0.328740  1.118943
     two  -0.903610 -1.349077

In [47]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
4 -3.129923  0.153163    a  one
b
     data1     data2 key1 key2
2 -0.32874  1.118943    b  one
3 -0.90361 -1.349077    b  two

In [52]:
for (k1,k2),aaa in df.groupby(['key1','key2']):
    print((k1,k2))
    print(aaa)

('a', 'one')
      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
4 -3.129923  0.153163    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.660992 -1.099575    a  two
('b', 'one')
     data1     data2 key1 key2
2 -0.32874  1.118943    b  one
('b', 'two')
     data1     data2 key1 key2
3 -0.90361 -1.349077    b  two

In [53]:
print(aaa)

     data1     data2 key1 key2
3 -0.90361 -1.349077    b  two

In [54]:
pececs=dict(list(df.groupby('key1')))

In [55]:
pececs['b']

     data1     data2 key1 key2
2 -0.32874  1.118943    b  one
3 -0.90361 -1.349077    b  two

In [56]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [58]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [59]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.450369
     two  -1.099575
b    one   1.118943
     two  -1.349077

In [60]:
df.groupby(['key1','key2'])['data2'].mean()

key1  key2
a     one     0.450369
      two    -1.099575
b     one     1.118943
      two    -1.349077
Name: data2, dtype: float64

In [61]:
s_grouped=df.groupby(['key1','key2'])['data2']

In [62]:
s_grouped

In [63]:
s_grouped.mean()

key1  key2
a     one     0.450369
      two    -1.099575
b     one     1.118943
      two    -1.349077
Name: data2, dtype: float64

In [64]:
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [65]:
people.iloc[2:3,[1,2]]=np.nan

In [66]:
people

               a         b         c         d         e
Joe    -0.522359 -0.073130  0.239947  0.306744 -0.139363
Steve  -2.398133 -1.537272 -0.766490  0.188521 -0.554948
Wes     1.544948       NaN       NaN  0.260813  0.501920
Jim    -1.651352 -0.061128 -0.511007  0.254163  0.797054
Travis  0.726304 -1.971316  0.187664  0.414297  1.338651

In [67]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [68]:
by_column=people.groupby(mapping,axis=1)

In [69]:
by_column.sum()

            blue       red
Joe     0.546691 -0.734851
Steve  -0.577969 -4.490352
Wes     0.260813  2.046868
Jim    -0.256844 -0.915427
Travis  0.601961  0.093640

In [71]:
map_series=pd.Series(mapping)

In [72]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [73]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [74]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.628763 -0.134258 -0.271060  0.821720  1.159611
5 -2.398133 -1.537272 -0.766490  0.188521 -0.554948
6  0.726304 -1.971316  0.187664  0.414297  1.338651

In [75]:
key_list=['one','one','one','two','two']

In [76]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.522359 -0.073130  0.239947  0.260813 -0.139363
  two -1.651352 -0.061128 -0.511007  0.254163  0.797054
5 one -2.398133 -1.537272 -0.766490  0.188521 -0.554948
6 two  0.726304 -1.971316  0.187664  0.414297  1.338651

In [77]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])

In [78]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)

In [79]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.445618 -0.311046  2.090729 -0.408594  0.193484
1      0.957311 -1.517590  1.041027  0.720765 -0.338990
2      0.484109 -2.028308  1.288529 -0.240644 -1.157896
3     -0.200518 -0.165474 -1.264318  0.197856  0.274562

In [81]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3